package com.datastructure.learning.basicTest.设计模式;

/**
 * @author: lipan
 * @date: 2020-04-15
 * @description:
 */
public class Demo {


    /**
     * Java 中一般认为有 23 种设计模式，我们不需要所有的都会，但是其中常用的几种设计模式应该去掌握。下面列
     * 出了所有的设计模式。需要掌握的设计模式我单独列出来了，当然能掌握的越多越好。
     *
     * 总体来说设计模式分为三大类：
     * 1、创建型模式，共五种： 工厂方法模式、 抽象工厂模式、 单例模式、 建造者模式、原型模式。
     * 2、结构型模式，共七种： 适配器模式、装饰器模式、 代理模式、外观模式、桥接模式、组合模式、 享元模式。
     * 3、行为型模式，共十一种： 策略模式、模板方法模式、 观察者模式、迭代子模式、责任链模式、命令模式、备忘录模
     * 式、状态模式、访问者模式、中介者模式、解释器模式
     */
}
