package com.datastructure.learning.leetcode.myLeetCode;

/**
 * @author: 59688
 * @date: 2021/3/23
 * @description: LeetCode高频面试题刷题指南： https://doocs.gitee.io/leetcode/#/
 */
public class SumarySolution {

    /**
     * 基础算法通关
     * TODO  排序算法
     * 冒泡排序
     * 插入排序
     * 选择排序
     * 归并排序
     * 快速排序
     * TODO  查找算法
     * 二分查找
     * 二分查找 II
     *
     * 面试高频考题
     *
     * TODO  数组
     * 删除排序数组中的重复项
     * 移除元素
     * 移动零
     * 数组中重复的数字
     * 旋转数组
     * 螺旋矩阵
     * 两数之和
     * 三数之和
     * 四数之和
     * 较小的三数之和
     * 最接近的三数之和
     * 合并两个有序数组
     * 寻找旋转排序数组中的最小值
     * 寻找旋转排序数组中的最小值 II
     * 除自身以外数组的乘积
     *
     * TODO 字符串
     * 反转字符串中的元音字母
     * 字符串转换整数 (atoi)
     * 赎金信
     *
     * TODO  链表
     * 两数相加
     * 从尾到头打印链表
     * 删除链表的节点
     * 移除链表元素
     * 链表中倒数第 k 个节点
     * 两两交换链表中的节点
     * 合并两个有序链表
     * 合并 K 个排序链表
     * 对链表进行插入排序
     * 排序链表
     * 反转链表
     * 反转链表 II
     * 重排链表
     * 旋转链表
     * 回文链表
     * 相交链表
     * 奇偶链表
     * 环形链表
     * 环形链表 II
     * 设计链表
     *
     * TODO  二叉树
     * 二叉树的前序遍历
     * 二叉树的后序遍历
     * 二叉树的中序遍历
     * 对称二叉树
     * 树的子结构
     * 翻转二叉树
     * 二叉树的层次遍历
     * 二叉树的层次遍历 II
     * 二叉树的最大深度
     * 二叉树的最小深度
     * 二叉树的所有路径
     * 路径总和
     * 路径总和 II
     * 从前序与中序遍历序列构造二叉树
     * 从中序与后序遍历序列构造二叉树
     * 二叉搜索树的后序遍历序列
     * 二叉树的最近公共祖先
     * 二叉搜索树的最近公共祖先
     * 将二叉搜索树转换为单链表
     * 将二叉搜索树转化为排序的双向链表
     *
     * TODO  数学
     * 只出现一次的数字
     * 只出现一次的数字 II
     * 只出现一次的数字 III
     * 错误的集合
     * 位 1 的个数
     * 计数质数
     * 不用加减乘除做加法
     * 丢失的数字
     *
     * TODO  栈和队列
     * 有效的括号
     * 最小栈
     * 队列的最大值
     * 用栈实现队列
     * 用队列实现栈
     * 逆波兰表达式求值
     * 最近的请求次数
     * 每日温度
     * 基本计算器 II
     *
     * TODO  动态规划
     * 最大子序和
     * 乘积最大子序列
     * 打家劫舍
     * 打家劫舍 II
     * 最长上升子序列
     * 俄罗斯套娃信封问题
     *
     * 混合问题
     * TODO  数据库
     * 组合两个表
     * 第二高的薪水
     * 第 N 高的薪水
     * 分数排名
     */
}
